In [1]:
import pandas as pd
import numpy as np

In [22]:
data= {'kor':[10,30,70,70],
       'eng':[20,40,80,60],
       'math':[33,44,55,66]}
df = pd.DataFrame(data, index=['a','b','c','d'])
df.index.name='이름'
df

    kor  eng  math
이름
a    10   20    33
b    30   40    44
c    70   80    55
d    70   60    66

In [4]:
df.to_excel(r'd:\my.xlsx')

In [6]:
df1 = pd.read_excel(r'd:\my.xlsx',index_col='이름')
df1

    kor  eng  math
이름
a    10   20    33
b    30   40    44
c    70   80    55
d    70   60    66

In [11]:
def fn(v):
#     print("========")
#     print("v=",v) # 시리즈
    return v.sum()

In [17]:
# df.apply( fn ,axis=0) # 컬럼 시리즈
# df.apply( fn  ,axis=1) #row 시리즈
# df.apply( fn)
# df.apply( lambda v:v.sum())
# df.apply(fn, axis=1)
# df.apply( lambda v:v.sum(), axis=1)
df['결과']=df.apply( lambda v: '합격' if v[0]>=50 else '불합격',
                  axis=1 )
df

    kor  eng  math   결과
이름
a    10   20    33  불합격
b    30   40    44  불합격
c    70   80    55   합격
d    70   60    66   합격

In [20]:
df['결과']=df['kor'].apply(lambda v: '합격' if v>=50 else '불합격')
df

    kor  eng  math   결과
이름
a    10   20    33  불합격
b    30   40    44  불합격
c    70   80    55   합격
d    70   60    66   합격

In [23]:
for n in df:
    print(n)

kor
eng
math

In [26]:
for i,ser in df.items(): # df.iteritems()
#     print(i, ser['a'],ser['b'],ser['c'],ser['d'])
    print(i, '%(a)d %(b)d %(c)d %(d)d'%ser )

kor 10 30 70 70
eng 20 40 80 60
math 33 44 55 66

In [29]:
for i,ser in df.iterrows():
    print(i, ser['kor'], ser['eng'], ser['math'])
#     print(n)

a 10 20 33
b 30 40 44
c 70 80 55
d 70 60 66